JayHeng/RT-SNAND/devices/MIMXRT1189/drivers/fsl_flexcan.c
    return fgRet;
}

/*!
 * brief Sub Handler Data Trasfered Events
 *
 * param base FlexCAN peripheral base address.
 * param handle FlexCAN handle pointer.
 * param pResult Pointer to the Handle result.
 *
 * return the status after handle each data transfered event.
 */
static status_t FLEXCAN_SubHandlerForDataTransfered(CAN_Type *base, flexcan_handle_t *handle, uint32_t *pResult)
{
    status_t status = kStatus_FLEXCAN_UnHandled;
    uint32_t result = 0xFFU;

#if (defined(FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER)) && (FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER > 0)
    uint32_t intflag[4] = {(base->IMASK1 & base->IFLAG1), (base->IMASK2 & base->IFLAG2), 0U, 0U};
#if defined(CAN_IMASK3_BUF95TO64M_MASK)
    intflag[2] = base->IMASK3 & base->IFLAG3;
#endif
#if defined(CAN_IMASK4_BUF127TO96M_MASK)
    intflag[3] = base->IMASK4 & base->IFLAG4;
#endif
#else
    uint32_t intflag = base->IMASK1 & base->IFLAG1;
#endif

    /* For this implementation, we solve the Message with lowest MB index first. */
#if (defined(FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER)) && (FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER > 0)
    for (uint32_t i = 0U; i < 4U; i++)
    {
        if (intflag[i] != 0U)
        {
            for (uint32_t j = 0U; j < 32U; j++)
            {
                if (0UL != (intflag[i] & ((uint32_t)1UL << j)))
                {
                    result = i * 32U + j;
                    break;
                }
            }
            break;
        }
    }
#else
    for (result = 0U; result < (uint32_t)FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(base); result++)
    {
        if (0UL != (intflag & ((uint32_t)1UL << result)))
        {
            break;
        }
    }
#endif

    /* find Message to deal with. */
    if (result < (uint32_t)FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(base))
    {
        /* Solve Legacy Rx FIFO interrupt. */
        if (((uint8_t)kFLEXCAN_StateIdle != handle->rxFifoState) && (result <= (uint32_t)CAN_IFLAG1_BUF7I_SHIFT) &&
            ((base->MCR & CAN_MCR_RFEN_MASK) != 0U))
        {
            uint32_t u32mask = 1;
            switch (u32mask << result)
            {
                case kFLEXCAN_RxFifoOverflowFlag:
                    status = kStatus_FLEXCAN_RxFifoOverflow;
                    break;

                case kFLEXCAN_RxFifoWarningFlag:
                    if ((handle->rxFifoFrameNum > 5U) && (0U != (base->IFLAG1 & (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag)))
                    {
                        for (uint32_t i = 0; i < 5UL; i++)
                        {
                            status = FLEXCAN_ReadRxFifo(base, handle->rxFifoFrameBuf);
                            /*
                             * $Branch Coverage Justification$
                             * (kStatus_Success != status) not covered. $ref flexcan_c_ref_1$.
                             */
                            if (kStatus_Success == status)
                            {
                                /* Align the current rxfifo timestamp to the timestamp array by handle. */
                                handle->timestamp[i] = handle->rxFifoFrameBuf->timestamp;
                                handle->rxFifoFrameBuf++;
                                handle->rxFifoFrameNum--;
                                /* Clean Rx Fifo available flag to discard the frame that has been read. */
                                FLEXCAN_ClearMbStatusFlags(base, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag);
                            }
                            else
                            {
                                /*
                                 * $Line Coverage Justification$
                                 * $ref flexcan_c_ref_1$.
                                 */
                                return kStatus_FLEXCAN_RxFifoDisabled;
                            }
                        }
                        if (handle->rxFifoFrameNum < 5UL)
                        {
                            /* Enable data avaliable interrupt. */
                            FLEXCAN_EnableMbInterrupts(base, (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag);
                        }
                        status = kStatus_FLEXCAN_RxFifoBusy;
                    }
                    else
                    {
                        /* Should enter case kFLEXCAN_RxFifoFrameAvlFlag but not, means previous transfer may have
                         * overflow*/
                        status = kStatus_FLEXCAN_RxFifoWarning;
                    }
                    break;

                case kFLEXCAN_RxFifoFrameAvlFlag:
                    /* Whether still has CAN messages remaining to be received. */
                    if (handle->rxFifoFrameNum > 0U)
                    {
                        status = FLEXCAN_ReadRxFifo(base, handle->rxFifoFrameBuf);
                        /*
                         * $Branch Coverage Justification$
                         * (kStatus_Success != status) not covered. $ref flexcan_c_ref_1$.
                         */
                        if (kStatus_Success == status)
                        {
                            /* Align the current (index 0) rxfifo timestamp to the timestamp array by handle. */
                            handle->timestamp[0] = handle->rxFifoFrameBuf->timestamp;
                            handle->rxFifoFrameBuf++;
                            handle->rxFifoFrameNum--;
                        }
                        else
                        {
                            /*
                             * $Line Coverage Justification$
                             * $ref flexcan_c_ref_1$.
                             */
                            return kStatus_FLEXCAN_RxFifoDisabled;
                        }
                    }
                    if (handle->rxFifoFrameNum == 0U)
                    {
                        /* Stop receiving Ehanced Rx FIFO when the transmission is over. */
                        FLEXCAN_TransferAbortReceiveFifo(base, handle);
                        status = kStatus_FLEXCAN_RxFifoIdle;
                    }
                    else
                    {
                        /* Continue use data avaliable interrupt. */
                        status = kStatus_FLEXCAN_RxFifoBusy;
                    }
                    break;

                default:
                    status = kStatus_FLEXCAN_UnHandled;
                    break;
            }
        }
        else
        {
            /* Get current State of Message Buffer. */
            switch (handle->mbState[result])
            {
                /* Solve Rx Data Frame. */
                case (uint8_t)kFLEXCAN_StateRxData:
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
                    if (0U != (base->MCR & CAN_MCR_FDEN_MASK))
                    {
                        status = FLEXCAN_ReadFDRxMb(base, (uint8_t)result, handle->mbFDFrameBuf[result]);
                        if (kStatus_Success == status)
                        {
                            /* Align the current index of RX MB timestamp to the timestamp array by handle. */
                            handle->timestamp[result] = handle->mbFDFrameBuf[result]->timestamp;
                            status                    = kStatus_FLEXCAN_RxIdle;
                        }
                    }
                    else
#endif
                    {
                        status = FLEXCAN_ReadRxMb(base, (uint8_t)result, handle->mbFrameBuf[result]);
                        if (kStatus_Success == status)
                        {
                            /* Align the current index of RX MB timestamp to the timestamp array by handle. */
                            handle->timestamp[result] = handle->mbFrameBuf[result]->timestamp;
                            status                    = kStatus_FLEXCAN_RxIdle;
                        }
                    }
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
                    if (0U != (base->MCR & CAN_MCR_FDEN_MASK))
                    {
                        FLEXCAN_TransferFDAbortReceive(base, handle, (uint8_t)result);
                    }
                    else
#endif
                    {
                        FLEXCAN_TransferAbortReceive(base, handle, (uint8_t)result);
                    }
                    break;

                /* Sove Rx Remote Frame.  User need to Read the frame in Mail box in time by Read from MB API. */
                case (uint8_t)kFLEXCAN_StateRxRemote:
                    status = kStatus_FLEXCAN_RxRemote;
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
                    if (0U != (base->MCR & CAN_MCR_FDEN_MASK))
                    {
                        FLEXCAN_TransferFDAbortReceive(base, handle, (uint8_t)result);
                    }
                    else
#endif
                    {
                        FLEXCAN_TransferAbortReceive(base, handle, (uint8_t)result);
                    }
                    break;

                /* Solve Tx Data Frame. */
                case (uint8_t)kFLEXCAN_StateTxData:
                    status = kStatus_FLEXCAN_TxIdle;
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
                    if (0U != (base->MCR & CAN_MCR_FDEN_MASK))
                    {
                        FLEXCAN_TransferFDAbortSend(base, handle, (uint8_t)result);
                    }
                    else
#endif
                    {
                        FLEXCAN_TransferAbortSend(base, handle, (uint8_t)result);
                    }
                    break;

                /* Solve Tx Remote Frame. */
                case (uint8_t)kFLEXCAN_StateTxRemote:
                    handle->mbState[result] = (uint8_t)kFLEXCAN_StateRxRemote;
                    status                  = kStatus_FLEXCAN_TxSwitchToRx;
                    break;

                default:
                    status = kStatus_FLEXCAN_UnHandled;
                    break;
            }
        }

        /* Clear resolved Message Buffer IRQ. */
#if (defined(FSL_FEATURE_FLEXCAN_HAS_MORE_THAN_64_MB) && FSL_FEATURE_FLEXCAN_HAS_MORE_THAN_64_MB)
        if (result >= 64U)
        {
            FLEXCAN_ClearHigh64MbStatusFlags(base, (uint64_t)1U << (result - 64U));
        }
        else
        {
            FLEXCAN_ClearMbStatusFlags(base, (uint64_t)1U << result);
        }
#elif (defined(FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER)) && (FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER > 0)
        FLEXCAN_ClearMbStatusFlags(base, (uint64_t)1U << result);
#else
        FLEXCAN_ClearMbStatusFlags(base, (uint32_t)1U << result);
#endif
    }

